import { FaqItem } from '../types/faqitem.ts';

const FAQ_ITEMS: FaqItem[] = [
  {
    id: 'faq-1',
    title: 'ДЛЯ КОГО СТАЖИРОВКА?',
    text: 'Практика в Институте Генплана ориентирована на студентов старших курсов. При этом у нас нет формальных ограничений по возрасту, уровню образования, регионам и вузам. Мы рады видеть всех, но предпочтение отдаем тем, кто закончил хотя бы три курса. Если вы очень хотите к нам, а опыта пока мало, мы в любом случаем будем рады принять вашу заявку. У вас всё равно будет шанс пройти, а в начале Практики в следующего года вы получите от нас приглашение на почту.',
  },
  {
    id: 'faq-2',
    title: 'КАКИЕ ПРОЕКТЫ БУДУТ РАЗРАБАТЫВАТЬ УЧАСТНИКИ СТАЖИРОВКИ И ПРАКТИКИ?',
    text: 'Список тем будет объявлен позднее. Мы работаем с реальными кейсами: никаких макетов и скучной бумажной работы.',
  },
  {
    id: 'faq-3',
    title: 'КАК ПРОХОДИТ КОНКУРС ПОРТФОЛИО?',
    text: 'Вы присылаете портфолио — кураторы их смотрят. Подсказка для тех, кто внимательно читает: портфолио с мотивационным письмом имеет больше шансов на успех, чем портфолио без него ;) При подаче заявки не забудьте прикрепить портфолио ссылкой на любой облачный сервис и открыть к нему доступ. Вы можете включить в портфолио всё, чем гордитесь — даже если это сертификат «Русского Медвежонка».',
  },
  {
    id: 'faq-4',
    title: 'КАК ОРГАНИЗОВАН ПРОЦЕСС?',
    text: 'На практике мы работаем в командах. В первый день мы собираемся на общую встречу, знакомимся с кураторами и обсуждаем результат, к которому должны прийти. После этого мы начинаем работу. На усмотрение куратора будет несколько очных встреч: обычно не больше двух раз в неделю. В конце нас ждет общая финальная защита проектов.',
  },
  {
    id: 'faq-5',
    title: 'ВЫДАДУТ ЛИ МНЕ ДОКУМЕНТЫ О ПРОХОЖДЕНИИ ПРАКТИКИ ДЛЯ ЗАЧЕТА В ВУЗЕ?',
    text: 'Да, мы выдаем все необходимые документы по итогам прохождения программ.',
  },
];

export default FAQ_ITEMS;
